# -*- coding: utf-8 -*-
"""
Created on Wed Apr  5 12:05:39 2017

@author: vitaliy grechachin
"""

pos = {'S', 'SPRON', 'ADJ', 'ADV', 'MODAL', 'V', 'INTJ', 'PART', 'POST', 'NUM', 'CONJ', 'PREP', '?', 'NAME'}
known_pos = {'NAME:S', 'NAME:SPRON', 'NAME:NUM', 'NAME:ADJ', 'NAME:ADV', 'V:V', 'MODAL:MODAL'}

non_inflected = ['CONJ', 'PREP', 'POST', 'INTJ', 'PART']

affgroups = {'pluralis',  'poss', 'iposs', 'derivabstr', 'abe', 'derivagens', 'assim', 'derivadj',
'derivadv', 'ord', 'col', 'comp', 'casus', 'pred', 'clitic', 'ger', 'mood', 'supin', 'tense',
'imperative', 'person', 'part', 'inf', 'aprx', 'divis', 'derivv', 'neg', 'genus', 'acyclic', 'request'}

interpretation = {'S': ['substantive', 'существительное', 'исем'], 'V': ['verb', 'глагол', 'ҡылым'], 'ADJ': ['adjective', 'адъектив', 'сифат'], 'NUM': ['numeral', 'числительное', 'һан'], 'SPRON': ['pronoun', 'местоимение', 'алмаш'], 'PART': ['particle', 'частица', 'киҫәксә'], 'POST': ['postposition', 'послелог', 'послелог'], 'CONJ': ['conjunction', 'союз', 'теркәүес'], 'INTJ': ['interjunction', 'междометие', 'ымлыҡ'], 'PREP': ['preposition', 'предлог', 'предлог'], 'PL': ['plural', 'множественное число', 'күплек'], 'SG': ['singular', 'единственное число', 'берлек'], '1SG': ['first person singular', 'первое лицо единственного числа', 'беренсе зат, берлек'], '2SG': ['second person singular', 'второе лицо единственного числа', 'икенсе зат, берлек'], '3SG': ['third person singular', 'третье лицо единственного числа', 'өсөнсө зат, берлек'], '1PL': ['first person plural', 'первое лицо множественного числа', 'беренсе зат, күплек'], '2PL': ['second person plural', 'вторе лицо множественного числа', 'икенсе зат, күплек'], '3PL': ['third person plural', 'третье лицо множественного числа', 'өсөнсө зат, берлек йәки күплек'], 'clit.UNCERT': ['uncertainty', 'клитика со значением неуверенности', 'килешһеҙлек'], 'clit.UNDEF': ['undefiniteness', 'клитика со значением предположительности', 'икеләнеү'], 'clit.INTERROG': ['interrogative', 'клитика со значением вопросительности', 'һорау'], 'clit.REQUEST': ['request', 'клитика со значением просьбы', 'үтенес'], 'PRED': ['predicative', 'сказуемость', 'хәбәрлек'], 'POSS': ['possessive', 'принадлежность', 'эйәлек'], 'IPOSS': ['impersonal possessive', 'неличная принадлежность', 'эйәлек ялғауы'], 'NOM': ['nominative case', 'основной падеж', 'төп килеш'], 'GEN': ['genitive case', 'родительный падеж', 'эйәлек килеш'], 'DAT': ['dative case', 'дательный падеж', 'төбәү килеш'], 'ACC': ['accusative case', 'винительный падеж', 'төшөм килеш'], 'ABL': ['ablative case', 'исходный падеж', 'сығанаҡ килеш'], 'LOC': ['locative case', 'местно-временной падеж', 'урын-ваҡыт килеш'], 'ABE': ['abessive case', 'абессив', 'юҡлыҡ килеш'], 'COM': ['commitative case', 'совместный падеж', 'бергәлек килеше'], 'DERIV.ABSTR': ['abstract noun', 'абстрактное существительное', 'абстракт исем'], 'DERIV.AGENS': ['agens noun', 'со значением деятеля', 'эшмәкәр'], 'DERIV.VERB': ['verb derivation', 'словообразование глагола', 'ҡылым яһаусы'], 'DERIV.ADJ': ['adjective derivation', 'словообразование адъектива', 'сифат яһаусы'], 'DERIV.ADV': ['adverb derivation', 'словообразование наречия', 'рәүеш яһаусы'], 'ASSIM': ['assimilation', 'уподобление', 'тәмҫил формаһы'], 'DIST': ['distinctive', 'выделительное (числительное)', 'айырыу һаны'], 'COL': ['collective', 'собирательное', 'йыйыу һаны'], 'ORD': ['ordinary', 'порядковое', 'рәт һаны'], 'APRX': ['approximative', 'приблизительное', 'сама һаны'], 'DIVIS': ['divisive', 'разделительное', 'бүлем һаны'], 'COMP': ['comparative', 'сравнительная степень', 'сағыштырыу дәрәжәһе'], 'ACYCL': ['acyclic', 'непериодическое действие', 'шартлы күләм'], 'GER': ['gerund', 'деепричастие', 'хәл ҡылым'], 'IMP': ['imperative mood', 'повелительное наклонение', 'бойороҡ һөйкәлеше'], 'REFL': ['reflexive genus', 'возвратный залог', 'ҡайтым йүнәлеше'], 'PASS': ['passive genus', 'страдательный залог', 'төшөм йүнәлеше'], 'RECP': ['reciprocal genus', 'взаимный залог', 'уртаҡлыҡ йүнәлеше'], 'CAUS': ['causative genus', 'понудительный залог', 'йөкмәтеү йүнәлеше'], 'NEG': ['negation', 'отрицание', 'юҡлыҡ формаһы'], 'PRES': ['present tense', 'настоящее время', 'хәҙерге заман'], 'PST.DEF': ['past definite tense', 'прошедшее определённое', 'билдәле үткән заман'], 'PST.INDF': ['past indefinite tense', 'прошедшее неопределённое', 'билдәһеҙ үткән заман'], 'FUT.INDF': ['future indefinite tense', 'будущее неопределённое', 'билдәһеҙ киләсәк заман'], 'FUT.DEF': ['future definite tense', 'будущее определённое', 'билдәле киләсәк заман'], 'DESI': ['desiderative mood', 'наклонение намерения', 'теләк һөйкәлеше'], 'COND': ['conditional mood', 'условное наклонение', 'шарт һөйкәлеше'], 'OPT': ['optative mood', 'желательное наклонение', 'теләк һөйкәлеше'], 'INF': ['infinitive', 'инфинитив', 'уртаҡҡылым'], 'SUP': ['supin', 'имя действия', 'исем ҡылым'], 'PAST.PART': ['past participle', 'причастие прошедшего времени', 'үткән заман сифат ҡылым '], 'FUT.PART': ['future participle', 'причастие будущего времени', 'киләсәк заман сифат ҡылым'], 'PARTICIPIUM': ['participle', 'причастие', 'сифат ҡылым'], 'SG/PL': ['singular or plural', 'единственное или множественное число', 'берлек йәки күплек']}

derivabstr = {
 # продуктивный словообразовательный аффикс абстрактных существительных также выступает как архаичная форма -лы/ле-
 ('лыҡ', 'DERIV.ABSTR'),
 ('лек', 'DERIV.ABSTR'),
 ('лик', 'DERIV.ABSTR'),
 ('лығ', 'DERIV.ABSTR'),
 ('лег', 'DERIV.ABSTR'),
 ('лоҡ', 'DERIV.ABSTR'),
 ('лөк', 'DERIV.ABSTR'),
 ('лоғ', 'DERIV.ABSTR'),
 ('лөг', 'DERIV.ABSTR'),
 }

derivagens = {
# продуктивный словообразовательный аффикс деятеля
 ('чы', 'DERIV.AGENS'),
 ('че', 'DERIV.AGENS'),
 }

derivadj = {
# продуктивный словообразовательный аффикс прилагательного
 ('лы', 'DERIV.ADJ'),
 ('ле', 'DERIV.ADJ'),
 ('лу', 'DERIV.ADJ'),
 ('лү', 'DERIV.ADJ'),
 ('чан', 'DERIV.ADJ'),
 ('чән', 'DERIV.ADJ'),
 }

derivadj_loc = {
# продуктивный словообразовательный аффикс прилагательного указывающий на местоположение
 ('ҡы', 'DERIV.ADJ'),
 ('ғы', 'DERIV.ADJ'),
 ('ке', 'DERIV.ADJ'),
 ('ге', 'DERIV.ADJ'),
}

derivadv = {
# продуктивный словообразовательный аффикс наречия
 ('ча', 'DERIV.ADV'),
 ('чә', 'DERIV.ADV'),
 }

derivv = {
# продуктивный словообразовательный аффикс глаголов
 ('ла', 'DERIV.VERB'),
 ('лә', 'DERIV.VERB'),
 }

# клитика
clitic = {
# клитика неуверенного предположения
 ('чы', 'clit.UNCERT'),
 ('че', 'clit.UNCERT'),
# клитика предположительности
 ('дыр', 'clit.UNDEF'),
 ('дер', 'clit.UNDEF'),
 ('дур', 'clit.UNDEF'),
 ('дүр', 'clit.UNDEF'),
# клитика вопроса
 ('мы', 'clit.INTERROG'),
 ('ме', 'clit.INTERROG'),
 ('му', 'clit.INTERROG'),
 ('мү', 'clit.INTERROG'),
 ('микән', 'clit.INTERROG')}

# сказуемость
pred = {
 ('мын', 'PRED,1SG'),
 ('мен', 'PRED,1SG'),
 ('сың', 'PRED,2SG'),
 ('сең', 'PRED,2SG'),
 ('дур', 'PRED,3SG'),
 ('дүр', 'PRED,3SG'),
 ('дер', 'PRED,3SG'),
 ('дыр', 'PRED,3SG'),
 ('мыз', 'PRED,1PL'),
 ('мез', 'PRED,1PL'),
 ('без', 'PRED,1PL'),
 ('быз', 'PRED,1PL'),
 ('сығыз', 'PRED,2PL'),
 ('сегез', 'PRED,2PL'),
 ('сыңыз', 'PRED,2PL'),
 ('сеңез', 'PRED,2PL')}

#абессив
abe = {
 ('сыз', 'ABE'),
 ('сез', 'ABE')}

#локатив
loc = {
 ('да', 'LOC'),
 ('дә', 'LOC'),
 ('нда', 'LOC'),
 ('ндә', 'LOC')}

#генитив
gen = {
 ('ның', 'GEN'),
 ('нең', 'GEN'),
 ('ың', 'GEN'),
 ('ең', 'GEN'),
 ('уң', 'GEN'),
 ('үң', 'GEN')}

#датив
dat = {
 ('ға', 'DAT'),
 ('гә', 'DAT'),
 ('ҡә', 'DAT'),
 ('кә', 'DAT'),
 ('ҡа', 'DAT'),
 ('ғә', 'DAT'),
 ('а', 'DAT'),
 ('ә', 'DAT'),
 ('на', 'DAT'),
 ('нә', 'DAT')}

#аблатив
abl = {
 ('дан', 'ABL'),
 ('дән', 'ABL'),
 ('ндан', 'ABL'),
 ('ндән', 'ABL'),
 ('дин', 'ABL'),
 ('ндин', 'ABL')}

#комитатив
com = {
 ('ла', 'COM'),
 ('лә', 'COM'),
 ('йла', 'COM'),
 ('йлә', 'COM'),
}

# падеж
casus = {
 ('ның', 'GEN'),
 ('нең', 'GEN'),
 ('ға', 'DAT'),
 ('гә', 'DAT'),
 ('ҡә', 'DAT'),
 ('кә', 'DAT'),
 ('ҡа', 'DAT'),
 ('ғә', 'DAT'),
 ('а', 'DAT'),
 ('ә', 'DAT'),
 ('на', 'DAT'),
 ('нә', 'DAT'),
 ('ны', 'ACC'),
 ('не', 'ACC'),
 ('н', 'ACC'),
 ('дан', 'ABL'),
 ('дән', 'ABL'),
 ('ндан', 'ABL'),
 ('ндән', 'ABL'),
 ('да', 'LOC'),
 ('дә', 'LOC'),
 ('нда', 'LOC'),
 ('ндә', 'LOC'),
# падеж огузского типа
 ('ың', 'GEN'),
 ('ең', 'GEN'),
 ('уң', 'GEN'),
 ('үң', 'GEN'),
 ('а', 'DAT'),
 ('ә', 'DAT'),
 ('йа', 'DAT'),
 ('йә', 'DAT'),
# падеж архаичного типа
 ('дин', 'ABL'),
 ('ндин', 'ABL'),
 ('ла', 'COM'),
 ('лә', 'COM'),
 ('йла', 'COM'),
 ('йлә', 'COM')}

# аффикс уподобления. Омонимичен форме настоящего времени.
assim = {
 ('дик', 'ASSIM'),
 ('тик', 'ASSIM'),
 ('дай', 'ASSIM'),
 ('дәй', 'ASSIM')}

# принадлежность
poss = {
 ('м', 'POSS,1SG'),
 ('ң', 'POSS,2SG'),
 ('ы', 'POSS,3SG/PL'),
 ('е', 'POSS,3SG/PL'),
 ('у', 'POSS,3SG/PL'),
 ('ү', 'POSS,3SG/PL'),
 ('о', 'POSS,3SG/PL'),
 ('ө', 'POSS,3SG/PL'),
 ('сы', 'POSS,3SG'),
 ('се', 'POSS,3SG'),
 ('ым', 'POSS,1SG'),
 ('ем', 'POSS,1SG'),
 ('ум', 'POSS,1SG'),
 ('үм', 'POSS,1SG'),
 ('ың', 'POSS,2SG'),
 ('ең', 'POSS,2SG'),
 ('уң', 'POSS,2SG'),
 ('үң', 'POSS,2SG'),
 ('мыз', 'POSS,1PL'),
 ('мез', 'POSS,1PL'),
 ('ңыз', 'POSS,2PL'),
 ('ңез', 'POSS,2PL'),
 ('лары', 'POSS,3PL'),
 ('ләре', 'POSS,3PL'),
 ('лару', 'POSS,3PL'),
 ('ләрү', 'POSS,3PL'),
 ('ымыз', 'POSS,1PL'),
 ('емез', 'POSS,1PL'),
 ('умыз', 'POSS,1PL'),
 ('үмез', 'POSS,1PL'),
 ('ыңыз', 'POSS,2PL'),
 ('еңез', 'POSS,2PL'),
 ('уңыз', 'POSS,2PL'),
 ('үңез', 'POSS,2PL')}

# неличная принадлежность
iposs = {
 ('ныҡы', 'IPOSS'),
 ('неке', 'IPOSS'),
 ('нуҡы', 'IPOSS'),
 ('нүке', 'IPOSS')}

# множественное число
pluralis = {
 ('дәр', 'PL'),
 ('лар', 'PL'),
 ('ләр', 'PL')}

# сравнительная степень адъективов
comp = {
 ('раҡ', 'COMP'),
 ('рәк', 'COMP'),
 ('ыраҡ', 'COMP'),
 ('ураҡ', 'COMP'),
 ('ерәк', 'COMP'),
 ('үрәк', 'COMP')}

# собирательность числительных
col = {
 ('әү', 'COL'),
 ('ау', 'COL')}

# приблизительность числительных
aprx = {
 ('лаб', 'APRX'),
 ('ләб', 'APRX'),
 ('лаған', 'APRX'),
 ('ләгән', 'APRX'),
 ('ләкән', 'APRX')}

# разделительность числительных
divis = {
 ('ар', 'DIVIS'),
 ('әр', 'DIVIS'),
 ('шар', 'DIVIS'),
 ('шәр', 'DIVIS'),
 ('ышар', 'DIVIS'),
 ('ешәр', 'DIVIS'),
 ('өшәр', 'DIVIS'),
 ('үшәр', 'DIVIS'),
 ('ушар', 'DIVIS')}


# порядковость у числительных
ord = {
 ('нчы', 'ORD'),
 ('нче', 'ORD'),
 ('енче', 'ORD'),
 ('ынчы', 'ORD'),
 ('өнчө', 'ORD')}

# деепричастие
ger = {
 ('б', 'GER'),
 ('ыб', 'GER'),
 ('еб', 'GER'),
 ('об', 'GER'),
 ('өб', 'GER'),
 ('уб', 'GER'),
 ('үб', 'GER'),
 ('ғач', 'GER'),
 ('гәч', 'GER'),
 ('ҡач', 'GER'),
 ('кәч', 'GER'),
 ('ғанчы', 'GER'),
 ('гәнче', 'GER'),
 ('ҡанчы', 'GER'),
 ('кәнче', 'GER'),
 ('ҡанча', 'GER'),
 ('ҡанчә', 'GER'),
 ('кәнчә', 'GER'),
 ('ғанча', 'GER'),
 ('ғанчә', 'GER'),
 ('гәнчә', 'GER'),
 ('ҡалы', 'GER'),
 ('ғалы', 'GER'),
 ('кәли', 'GER'),
 ('гәли', 'GER'),
 ('убан', 'GER'),
 ('үбән', 'GER'),
}

# залог
genus = {
 ('н', 'REFL'),
 ('ын', 'REFL'),
 ('ен', 'REFL'),
 ('үн', 'REFL'),
 ('ун', 'REFL'),
 ('л', 'PASS'),
 ('ыл', 'PASS'),
 ('ел', 'PASS'),
 ('ул', 'PASS'),
 ('үл', 'PASS'),
 ('н', 'PASS'),
 ('ын', 'PASS'),
 ('ен', 'PASS'),
 ('ун', 'PASS'),
 ('үн', 'PASS'),
 ('ш', 'RECP'),
 ('ыш', 'RECP'),
 ('еш', 'RECP'),
 ('уш', 'RECP'),
 ('үш', 'RECP'),
 ('дур', 'CAUS'),
 ('дүр', 'CAUS'),
 ('т', 'CAUS'),
 ('ҡыр', 'CAUS'),
 ('кер', 'CAUS'),
 ('ғыр', 'CAUS'),
 ('гер', 'CAUS'),
 ('күз', 'CAUS'),
 ('ҡуз', 'CAUS'),
 ('гүз', 'CAUS'),
 ('ғуз', 'CAUS'),
}

# отрицание
neg = {
 ('ма', 'NEG'),
 ('мә', 'NEG'),
 ('мас', 'NEG,FUT.INDF'),
 ('мәс','NEG,FUT.INDF'),

# отрицание огузского типа
 ('маз', 'NEG,FUT.INDF'),
 ('мәз', 'NEG,FUT.INDF'),
}

# лицо
person = {
 ('м', '1SG'),
 ('ым', '1SG'),
 ('ем', '1SG'),
 ('мен', '1SG'),
 ('мын', '1SG'),
 ('cең', '2SG'),
 ('cың', '2SG'),
 ('cән', '2SG'),
 ('без', '1PL'),
 ('быз', '1PL'),
 ('мез', '1PL'),
 ('мыз', '1PL'),
 ('ҡ', '1PL'),
 ('к', '1PL'),
 ('сез', '2PL'),
 ('сыз', '2PL'),
 ('сезләр', '2PL'),
 ('сызлар', '2PL'),
 ('ңыз', '2PL'),
 ('ңез', '2PL'),
 ('лар', '3PL'),
 ('ләр', '3PL'),
}


# время
tense = {
 ('а', 'PRES'),
 ('ә', 'PRES'),
 ('й', 'PRES'),
 ('йар', 'PRES'),
 ('ды', 'PST.DEF'),
 ('де', 'PST.DEF'),
 ('ду', 'PST.DEF'),
 ('дү', 'PST.DEF'),
 ('рды', 'PST.INDF'),
 ('рде', 'PST.INDF'),
 ('әрде', 'PST.INDF'),
 ('ерде', 'PST.INDF'),
 ('ырды', 'PST.INDF'),
 ('урды', 'PST.INDF'),
 ('үрде', 'PST.INDF'),
 ('ғай', 'FUT.INDF'),
 ('гәй', 'FUT.INDF'),
 ('кәй', 'FUT.INDF'),}



tense_participium = {# время принимающее падежные окончания
 ('мыш', 'PST.INDF'),
 ('меш', 'PST.INDF'),
 ('муш', 'PST.INDF'),
 ('мүш', 'PST.INDF'),
 ('әр', 'FUT.INDF'),
 ('ар', 'FUT.INDF'),
 ('ған', 'PST.INDF'),
 ('гән', 'PST.INDF'),
 ('ҡан', 'PST.INDF'),
 ('кән', 'PST.INDF'),
 ('кән', 'PST.INDF'),
 ('р', 'FUT.INDF'),
 ('ыр', 'FUT.INDF'),
 ('ер', 'FUT.INDF'),
 ('ур', 'FUT.INDF'),
 ('үр', 'FUT.INDF'),
 ('ачаҡ', 'FUT.DEF'),
 ('әчәк', 'FUT.DEF'),
 ('йачаҡ', 'FUT.DEF'),
 ('йәчәк', 'FUT.DEF'),
}

# наклонение
mood = {
 ('маҡчы', 'DESI'),
 ('мәкче', 'DESI'),
 ('маҡ', 'DESI'),
 ('мәк', 'DESI'),
 ('са', 'COND'),
 ('сә', 'COND'),
 ('ғы', 'OPT'),
 ('ге', 'OPT'),
 ('ҡы', 'OPT'),
 ('ке', 'OPT'),
 ('асы', 'OPT'), #вот здесь аффикс желательного наклонения, который в морфологическом анализаторе
 ('әсе', 'OPT'), #дается как “һы/һе”
}

# императив или желательное наклонение
imperative = {
#императив или желательное наклонение
 ('айым', 'IMP,1SG'),
 ('әйем', 'IMP,1SG'),
 ('йым', 'IMP,1SG'),
 ('йем', 'IMP,1SG'),
 ('ғыл', 'IMP,2SG'),
 ('гел', 'IMP,2SG'),
 ('ҡыл', 'IMP,2SG'), # архаичное
 ('кел', 'IMP,2SG'), # архаичное
 ('сын', 'IMP,3SG'),
 ('сен', 'IMP,3SG'),
 ('сун', 'IMP,3SG'),
 ('сүн', 'IMP,3SG'),
 ('айыҡ', 'IMP,1PL'),
 ('әйек', 'IMP,1PL'),
 ('алым', 'IMP,1SG'),
 ('әлем', 'IMP,1SG'),
 ('йыҡ', 'IMP,1PL'),
 ('йек', 'IMP,1PL'),
 ('ңез', 'IMP,2PL'),
 ('ңыз', 'IMP,2PL'),
 ('еңез', 'IMP,2PL'),
 ('ыңез', 'IMP,2PL'),
 ('ең', 'IMP,2PL'),    #
 ('ың', 'IMP,2PL'),    #
 ('уң', 'IMP,2PL'),    # - огузские+диалектные
 ('үң', 'IMP,2PL'),    #
 ('ң', 'IMP,2PL'),     #
 ('сынлар', 'IMP,3PL'),
 ('сенләр', 'IMP,3PL'),
 ('сунлар', 'IMP,3PL'),
 ('сүнләр', 'IMP,3PL'),
}

# инфинитив
inf = {
 ('рға', 'INF'),
 ('ргә', 'INF'),
 ('урға', 'INF'),
 ('әркә', 'INF'),
 ('рғә', 'INF'),
 ('урғә', 'INF'),
 ('арға', 'INF'),
 ('урға', 'INF'),
 ('әргә', 'INF'),

# инфинитив огузского типа он же иногда выступает как имя действия
 ('маҡ', 'INF'),
 ('мәк', 'INF'),
 ('мағ', 'INF'),
 ('мәг', 'INF'),

# инфинитив диалектный
 ('маға', 'INF'),
 ('мәгә', 'INF'),
}

# имя действия
supin = {
 ('у', 'SUP'),
 ('ү', 'SUP'),
 ('ыу', 'SUP'),
 ('еү', 'SUP'),
 ('оу', 'SUP'),
 ('өү', 'SUP'),
}

# аффикс непериодического действия
acyclic = {
 ('ҡүла', 'ACYCL'),
 ('күлә', 'ACYCL'),
 ('ғула', 'ACYCL'),
 ('гүлә', 'ACYCL'),
 ('штур', 'ACYCL'),
 ('штүр', 'ACYCL'),
 ('уштур', 'ACYCL'),
 ('үштүр', 'ACYCL'),
}

#причастие
part = {
 ('дуғы', 'PAST.PART'),
 ('дығы', 'PAST.PART'),
 ('дүке', 'PAST.PART'),
 ('дүки', 'PAST.PART'),
 ('дачы', 'FUT.PART'),
 ('тачы', 'FUT.PART'),
 ('ғучы', 'PARTICIPIUM'),
 ('күче', 'PARTICIPIUM'),
}
